# Clone Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
LightShape..::..Clone Method
LightShape Class See Also
---
Creates a copy of the LightShape derived object.
**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public LightShape Clone()
```

Visual Basic
---
```text
Public Function Clone As LightShape
```

Visual C++
---
```text
public:
LightShape^ Clone()
```

# See Also
LightShape Class
Autodesk.Revit.DB.Lighting Namespace